{
  "totalArticles": 212624,
  "articles": [
    {
      "title": "SEBI cracks India's first big \"spoofing\" case that involved a stock broker and 173 stocks",
      "description": "The regulator investigated Patel Wealth Advisors and its directors over three years",
      "content": "Spoofing involves placing large, phantom orders that are disclosed but way below the market price to create a false impression of demand.\nA stock broker who \"spoofed\" orders to create an artificial demand for stocks, and its associates, have been ask... [2843 chars]",
      "url": "https://www.moneycontrol.com/news/business/markets/sebi-cracks-indias-first-big-spoofing-case-that-involved-a-stock-broker-and-173-stocks-13007233.html",
      "image": "https://images.moneycontrol.com/static-mcnews/2025/02/20250217064158_Online-Student-Scam.png",
      "publishedAt": "2025-04-28T11:52:24Z",
      "source": {
        "name": "Moneycontrol",
        "url": "https://www.moneycontrol.com"
      }
    },
    {
      "title": "Shriram Finance Share Price Target: NBFC stock tanks 9% in 1 day - Time to grab the opportunity? BUY, SELL or HOLD",
      "description": "Shriram Finance Share Price Target: Shares of Shriram Finance tumbled as much as 9 per cent in today's trading session. The stock witnessed heavy volume trade with 12.90 lakh shares changing hands against the two weeks’ average quantity of 1.59 lakh shares. Also, the company reported an 18 per cent YoY jump in its interest income that stood at Rs 10,790 crore. Should you BUY, SELL, or HOLD?",
      "content": "Shriram Finance Share Price Target : Shares of Shriram Finance tumbled as much as 9 per cent in today's trading session. The stock witnessed heavy volume trade with 12.90 lakh shares changing hands against the two weeks’ average quantity of 1.59 lakh... [2627 chars]",
      "url": "https://www.etnownews.com/markets/shriram-finance-share-price-target-nbfc-stock-tanks-9-in-1-day-time-to-grab-the-opportunity-buy-sell-or-hold-article-151522131",
      "image": "https://images.etnownews.com/thumb/msid-151522131,updatedat-1745837501032,width-1280,height-720,resizemode-75/151522131.jpg",
      "publishedAt": "2025-04-28T10:51:40Z",
      "source": {
        "name": "ET Now",
        "url": "https://www.etnownews.com"
      }
    }
  ]
}
